app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-04-01 06:22:50.026445"], ["updated_at", "2017-04-01 06:22:50.026445"]]